#unicode: utf-8
''''



Обединение на условие |, сечение &

TRUE + TRUE = 2

sum(x == 5) - броят на елементите които са равни на 5
sum(1:10) - 55

Главно използваме вектор и data frame

 - Вектор създаване, чрез функцията c. Пример: x = c(1, 2, 3)
 	Може и чрез x = 1:10 и тн
	
	x[вектор от индекси които искаме] -> x[c(1, 2, 3)] или с TRUE И FALSE x[c(TRUE, FLASE, TRUE)]
	когато искаме да пропуснем някой индекс слагаме минус отпре -> x[-c(1, 2)]

	x == 1 - връща вектор от истина или лъжа

	x[x == 1] или x[which(x == 1)] # which връща индексите на изпълнителите на условието

 - Data frame - извадки от данни
 Можем да прочетем data frame от csv, чрез read.csv()
Обобщено това е множество което се съдържа от наименувани вектори с еднаква дължина
df = data.frame(c(1, 2), c(3, 4))
● head() - дава първите 6 реда
● tail() - дава последните 6 реда
● dim() - размерности (вектор от брой редове и брой колони)
● nrow()
● ncol()
● names() -дава имената на колоните (работи не само с df)
------------------------------------------------------------------------------------
функции за: mean, median, min, max, range, var (dispersion), sd (standart deviation)

------------------------------------------------------------------------------------
ДАННИ
 - количествени 
 - качествени (категорни)
   - дискретни
   - непрекъснати

ОПИСВАМЕ:
	КАТЕГОРНИ ЧРЕЗ: таблици, bar chart, pie chart
		Таблици (table(вектор от данни)): честота, относителна честота. Промяна на имена на колоните: names(someTable) = c("someData0", "someData1")
		Factors (factor(вектор от данни)) - различните стойности, които категорните данни могат да заемат, се наричат нива
		barplot(someTable)
		barplot(someTable / length(someVector)) - относителни честоти
		pie(someTable, col = c("someColor", "someColor")) # rainbow

	Количествени данни: 
		- ако приема изборимо много стойности е дискретна
		- ако приема неизброимо - непрекъсната

	Хитри функции: fivenum - # min, lower hinge, Median, upper hinge, max
					summary - # min, 1st Qu. Median Mean 3rd Qu. Max.
	Квантили - quantile(данни, вектор с всички квантили, които искаме) quantile(someData, c(.25, .75)) # може и да е само едно число, а не вектор

	Диаграма клони с листа Stem and leaf chart - stem(scores) # scores - вектор с данни

	Преобразуване на Числови в категорни:
	TODO: допиши 19 слайд от presentation2
 '''